{
  "format": "layers-model",
  "generatedBy": "manual",
  "convertedBy": "chatgpt",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "name": "dense"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            1,
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}